---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.NoConstraintsToLinks
source: html/ca571c82-028c-76c2-e70e-96a9d2e3dd5e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.NoConstraintsToLinks Property

Constraints may not be created to linked instances using Shared Locations.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoConstraintsToLinks { get; }
```